#include <iostream>
#include <cmath> // Подключаем библиотеку для математических функций

using namespace std;

int main() {
    double x0, y0, r1, r2, x, y;  // Координаты центра, радиусы и точка

    cout << "Введите координаты центра кольца (x0, y0): ";
    cin >> x0 >> y0;

    cout << "Введите радиусы кольца (r1, r2): ";
    cin >> r1 >> r2;

    cout << "Введите координаты точки (x, y): ";
    cin >> x >> y;

    // Вычисляем расстояние от центра кольца до точки
    double a = x - x0;
    double b = y - y0;
    double L = sqrt(pow(a, 2) + pow(b, 2));

    // Проверяем принадлежность точки кольцу
    if (L >= r1 && L <= r2) {
        cout << "Точка принадлежит кольцу.\n";
    }
    else {
        cout << "Точка не принадлежит кольцу.\n";
    }

    return 0;
}
